Revit.Elements.Coordinates
Nodes exposing Revit Document Base and Survey Point

Revit.Elements.Coordinates.GetBaseOrSurveyPoint(System.Boolean)
Get Base or SurveyPoint
surveypoint:
Returns:

Revit.Elements.Coordinates.ProjectRotation
Get Project Rotation
Returns: Rotation in degrees

Revit.Elements.Coordinates.BasePoint
Get Project Base Point
Returns: Project Base Point

Revit.Elements.Coordinates.SurveyPoint
Get Survey Point
Returns: Survey Point